{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "filters": 6, "activity_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 4, "activity_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [2, 2], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 3, "activity_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 64, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 32, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 10, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.6"}