{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 6, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "padding": "same", "activation": "linear", "bias_constraint": null, "batch_input_shape": [null, 1, 28, 28], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "filters": 4, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "kernel_size": [2, 2], "filters": 4, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 64, "trainable": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 32, "trainable": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 10, "trainable": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}}], "keras_version": "2.0.6"}