{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 28, 28], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "conv2d_1", "use_bias": true, "filters": 6, "dtype": "float32", "padding": "same", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "conv2d_2", "filters": 4, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "conv2d_3", "filters": 4, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "dense_1", "units": 64, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "dense_2", "units": 32, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "dense_3", "units": 10, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "class_name": "Sequential"}