Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 6, 28, 28)         60
_________________________________________________________________
activation_1 (Activation)    (None, 6, 28, 28)         0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 26, 26)         220
_________________________________________________________________
activation_2 (Activation)    (None, 4, 26, 26)         0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 13, 13)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 12, 12)         51
_________________________________________________________________
activation_3 (Activation)    (None, 3, 12, 12)         0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 6, 6)           0
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 6, 6)           0
_________________________________________________________________
flatten_1 (Flatten)          (None, 108)               0
_________________________________________________________________
dense_1 (Dense)              (None, 64)                6976
_________________________________________________________________
activation_4 (Activation)    (None, 64)                0
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080
_________________________________________________________________
activation_5 (Activation)    (None, 32)                0
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0
_________________________________________________________________
dense_3 (Dense)              (None, 10)                330
_________________________________________________________________
activation_6 (Activation)    (None, 10)                0
=================================================================
Total params: 9,717
Trainable params: 9,717
Non-trainable params: 0